GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.inc
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
CCP4CAP                                  equ 031Bh
// bitfield definitions
CCP4CAP_CTS_POSN                         equ 0000h
CCP4CAP_CTS_POSITION                     equ 0000h
CCP4CAP_CTS_SIZE                         equ 0008h
CCP4CAP_CTS_LENGTH                       equ 0008h
CCP4CAP_CTS_MASK                         equ 00FFh
CCP4CAP_CTS0_POSN                        equ 0000h
CCP4CAP_CTS0_POSITION                    equ 0000h
CCP4CAP_CTS0_SIZE                        equ 0001h
CCP4CAP_CTS0_LENGTH                      equ 0001h
CCP4CAP_CTS0_MASK                        equ 0001h
CCP4CAP_CTS1_POSN                        equ 0001h
CCP4CAP_CTS1_POSITION                    equ 0001h
CCP4CAP_CTS1_SIZE                        equ 0001h
CCP4CAP_CTS1_LENGTH                      equ 0001h
CCP4CAP_CTS1_MASK                        equ 0002h
CCP4CAP_CTS2_POSN                        equ 0002h
CCP4CAP_CTS2_POSITION                    equ 0002h
CCP4CAP_CTS2_SIZE                        equ 0001h
CCP4CAP_CTS2_LENGTH                      equ 0001h
CCP4CAP_CTS2_MASK                        equ 0004h
CCP4CAP_CTS3_POSN                        equ 0003h
CCP4CAP_CTS3_POSITION                    equ 0003h
CCP4CAP_CTS3_SIZE                        equ 0001h
CCP4CAP_CTS3_LENGTH                      equ 0001h
CCP4CAP_CTS3_MASK                        equ 0008h
CCP4CAP_CTS4_POSN                        equ 0004h
CCP4CAP_CTS4_POSITION                    equ 0004h
CCP4CAP_CTS4_SIZE                        equ 0001h
CCP4CAP_CTS4_LENGTH                      equ 0001h
CCP4CAP_CTS4_MASK                        equ 0010h
CCP4CAP_CTS5_POSN                        equ 0005h
CCP4CAP_CTS5_POSITION                    equ 0005h
CCP4CAP_CTS5_SIZE                        equ 0001h
CCP4CAP_CTS5_LENGTH                      equ 0001h
CCP4CAP_CTS5_MASK                        equ 0020h
CCP4CAP_CTS6_POSN                        equ 0006h
CCP4CAP_CTS6_POSITION                    equ 0006h
CCP4CAP_CTS6_SIZE                        equ 0001h
CCP4CAP_CTS6_LENGTH                      equ 0001h
CCP4CAP_CTS6_MASK                        equ 0040h
CCP4CAP_CTS7_POSN                        equ 0007h
CCP4CAP_CTS7_POSITION                    equ 0007h
CCP4CAP_CTS7_SIZE                        equ 0001h
CCP4CAP_CTS7_LENGTH                      equ 0001h
CCP4CAP_CTS7_MASK                        equ 0080h
CCP4CAP_CCP4CTS_POSN                     equ 0000h
CCP4CAP_CCP4CTS_POSITION                 equ 0000h
CCP4CAP_CCP4CTS_SIZE                     equ 0008h
CCP4CAP_CCP4CTS_LENGTH                   equ 0008h
CCP4CAP_CCP4CTS_MASK                     equ 00FFh
CCP4CAP_CCP4CTS0_POSN                    equ 0000h
CCP4CAP_CCP4CTS0_POSITION                equ 0000h
CCP4CAP_CCP4CTS0_SIZE                    equ 0001h
CCP4CAP_CCP4CTS0_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS0_MASK                    equ 0001h
CCP4CAP_CCP4CTS1_POSN                    equ 0001h
CCP4CAP_CCP4CTS1_POSITION                equ 0001h
CCP4CAP_CCP4CTS1_SIZE                    equ 0001h
CCP4CAP_CCP4CTS1_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS1_MASK                    equ 0002h
CCP4CAP_CCP4CTS2_POSN                    equ 0002h
CCP4CAP_CCP4CTS2_POSITION                equ 0002h
CCP4CAP_CCP4CTS2_SIZE                    equ 0001h
CCP4CAP_CCP4CTS2_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS2_MASK                    equ 0004h
CCP4CAP_CCP4CTS3_POSN                    equ 0003h
CCP4CAP_CCP4CTS3_POSITION                equ 0003h
CCP4CAP_CCP4CTS3_SIZE                    equ 0001h
CCP4CAP_CCP4CTS3_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS3_MASK                    equ 0008h
CCP4CAP_CCP4CTS4_POSN                    equ 0004h
CCP4CAP_CCP4CTS4_POSITION                equ 0004h
CCP4CAP_CCP4CTS4_SIZE                    equ 0001h
CCP4CAP_CCP4CTS4_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS4_MASK                    equ 0010h
CCP4CAP_CCP4CTS5_POSN                    equ 0005h
CCP4CAP_CCP4CTS5_POSITION                equ 0005h
CCP4CAP_CCP4CTS5_SIZE                    equ 0001h
CCP4CAP_CCP4CTS5_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS5_MASK                    equ 0020h
CCP4CAP_CCP4CTS6_POSN                    equ 0006h
CCP4CAP_CCP4CTS6_POSITION                equ 0006h
CCP4CAP_CCP4CTS6_SIZE                    equ 0001h
CCP4CAP_CCP4CTS6_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS6_MASK                    equ 0040h
CCP4CAP_CCP4CTS7_POSN                    equ 0007h
CCP4CAP_CCP4CTS7_POSITION                equ 0007h
CCP4CAP_CCP4CTS7_SIZE                    equ 0001h
CCP4CAP_CCP4CTS7_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS7_MASK                    equ 0080h

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 031Ch
// bitfield definitions
CCPR5L_RL_POSN                           equ 0000h
CCPR5L_RL_POSITION                       equ 0000h
CCPR5L_RL_SIZE                           equ 0008h
CCPR5L_RL_LENGTH                         equ 0008h
CCPR5L_RL_MASK                           equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 031Dh
// bitfield definitions
CCPR5H_RH_POSN                           equ 0000h
CCPR5H_RH_POSITION                       equ 0000h
CCPR5H_RH_SIZE                           equ 0008h
CCPR5H_RH_LENGTH                         equ 0008h
CCPR5H_RH_MASK                           equ 00FFh

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 031Eh
// bitfield definitions
CCP5CON_MODE_POSN                        equ 0000h
CCP5CON_MODE_POSITION                    equ 0000h
CCP5CON_MODE_SIZE                        equ 0004h
CCP5CON_MODE_LENGTH                      equ 0004h
CCP5CON_MODE_MASK                        equ 000Fh
CCP5CON_FMT_POSN                         equ 0004h
CCP5CON_FMT_POSITION                     equ 0004h
CCP5CON_FMT_SIZE                         equ 0001h
CCP5CON_FMT_LENGTH                       equ 0001h
CCP5CON_FMT_MASK                         equ 0010h
CCP5CON_OUT_POSN                         equ 0005h
CCP5CON_OUT_POSITION                     equ 0005h
CCP5CON_OUT_SIZE                         equ 0001h
CCP5CON_OUT_LENGTH                       equ 0001h
CCP5CON_OUT_MASK                         equ 0020h
CCP5CON_OE_POSN                          equ 0006h
CCP5CON_OE_POSITION                      equ 0006h
CCP5CON_OE_SIZE                          equ 0001h
CCP5CON_OE_LENGTH                        equ 0001h
CCP5CON_OE_MASK                          equ 0040h
CCP5CON_EN_POSN                          equ 0007h
CCP5CON_EN_POSITION                      equ 0007h
CCP5CON_EN_SIZE                          equ 0001h
CCP5CON_EN_LENGTH                        equ 0001h
CCP5CON_EN_MASK                          equ 0080h
CCP5CON_MODE0_POSN                       equ 0000h
CCP5CON_MODE0_POSITION                   equ 0000h
CCP5CON_MODE0_SIZE                       equ 0001h
CCP5CON_MODE0_LENGTH                     equ 0001h
CCP5CON_MODE0_MASK                       equ 0001h
CCP5CON_MODE1_POSN                       equ 0001h
CCP5CON_MODE1_POSITION                   equ 0001h
CCP5CON_MODE1_SIZE                       equ 0001h
CCP5CON_MODE1_LENGTH                     equ 0001h
CCP5CON_MODE1_MASK                       equ 0002h
CCP5CON_MODE2_POSN                       equ 0002h
CCP5CON_MODE2_POSITION                   equ 0002h
CCP5CON_MODE2_SIZE                       equ 0001h
CCP5CON_MODE2_LENGTH                     equ 0001h
CCP5CON_MODE2_MASK                       equ 0004h
CCP5CON_MODE3_POSN                       equ 0003h
CCP5CON_MODE3_POSITION                   equ 0003h
CCP5CON_MODE3_SIZE                       equ 0001h
CCP5CON_MODE3_LENGTH                     equ 0001h
CCP5CON_MODE3_MASK                       equ 0008h
CCP5CON_CCP5MODE_POSN                    equ 0000h
CCP5CON_CCP5MODE_POSITION                equ 0000h
CCP5CON_CCP5MODE_SIZE                    equ 0004h
CCP5CON_CCP5MODE_LENGTH                  equ 0004h
CCP5CON_CCP5MODE_MASK                    equ 000Fh
CCP5CON_CCP5FMT_POSN                     equ 0004h
CCP5CON_CCP5FMT_POSITION                 equ 0004h
CCP5CON_CCP5FMT_SIZE                     equ 0001h
CCP5CON_CCP5FMT_LENGTH                   equ 0001h
CCP5CON_CCP5FMT_MASK                     equ 0010h
CCP5CON_CCP5OUT_POSN                     equ 0005h
CCP5CON_CCP5OUT_POSITION                 equ 0005h
CCP5CON_CCP5OUT_SIZE                     equ 0001h
CCP5CON_CCP5OUT_LENGTH                   equ 0001h
CCP5CON_CCP5OUT_MASK                     equ 0020h
CCP5CON_CCP5OE_POSN                      equ 0006h
CCP5CON_CCP5OE_POSITION                  equ 0006h
CCP5CON_CCP5OE_SIZE                      equ 0001h
CCP5CON_CCP5OE_LENGTH                    equ 0001h
CCP5CON_CCP5OE_MASK                      equ 0040h
CCP5CON_CCP5EN_POSN                      equ 0007h
CCP5CON_CCP5EN_POSITION                  equ 0007h
CCP5CON_CCP5EN_SIZE                      equ 0001h
CCP5CON_CCP5EN_LENGTH                    equ 0001h
CCP5CON_CCP5EN_MASK                      equ 0080h
CCP5CON_CCP5MODE0_POSN                   equ 0000h
CCP5CON_CCP5MODE0_POSITION               equ 0000h
CCP5CON_CCP5MODE0_SIZE                   equ 0001h
CCP5CON_CCP5MODE0_LENGTH                 equ 0001h
CCP5CON_CCP5MODE0_MASK                   equ 0001h
CCP5CON_CCP5MODE1_POSN                   equ 0001h
CCP5CON_CCP5MODE1_POSITION               equ 0001h
CCP5CON_CCP5MODE1_SIZE                   equ 0001h
CCP5CON_CCP5MODE1_LENGTH                 equ 0001h
CCP5CON_CCP5MODE1_MASK                   equ 0002h
CCP5CON_CCP5MODE2_POSN                   equ 0002h
CCP5CON_CCP5MODE2_POSITION               equ 0002h
CCP5CON_CCP5MODE2_SIZE                   equ 0001h
CCP5CON_CCP5MODE2_LENGTH                 equ 0001h
CCP5CON_CCP5MODE2_MASK                   equ 0004h
CCP5CON_CCP5MODE3_POSN                   equ 0003h
CCP5CON_CCP5MODE3_POSITION               equ 0003h
CCP5CON_CCP5MODE3_SIZE                   equ 0001h
CCP5CON_CCP5MODE3_LENGTH                 equ 0001h
CCP5CON_CCP5MODE3_MASK                   equ 0008h

// Register: CCP5CAP
#define CCP5CAP CCP5CAP
CCP5CAP                                  equ 031Fh
// bitfield definitions
CCP5CAP_CTS_POSN                         equ 0000h
CCP5CAP_CTS_POSITION                     equ 0000h
CCP5CAP_CTS_SIZE                         equ 0008h
CCP5CAP_CTS_LENGTH                       equ 0008h
CCP5CAP_CTS_MASK                         equ 00FFh
CCP5CAP_CTS0_POSN                        equ 0000h
CCP5CAP_CTS0_POSITION                    equ 0000h
CCP5CAP_CTS0_SIZE                        equ 0001h
CCP5CAP_CTS0_LENGTH                      equ 0001h
CCP5CAP_CTS0_MASK                        equ 0001h
CCP5CAP_CTS1_POSN                        equ 0001h
CCP5CAP_CTS1_POSITION                    equ 0001h
CCP5CAP_CTS1_SIZE                        equ 0001h
CCP5CAP_CTS1_LENGTH                      equ 0001h
CCP5CAP_CTS1_MASK                        equ 0002h
CCP5CAP_CTS2_POSN                        equ 0002h
CCP5CAP_CTS2_POSITION                    equ 0002h
CCP5CAP_CTS2_SIZE                        equ 0001h
CCP5CAP_CTS2_LENGTH                      equ 0001h
CCP5CAP_CTS2_MASK                        equ 0004h
CCP5CAP_CTS3_POSN                        equ 0003h
CCP5CAP_CTS3_POSITION                    equ 0003h
CCP5CAP_CTS3_SIZE                        equ 0001h
CCP5CAP_CTS3_LENGTH                      equ 0001h
CCP5CAP_CTS3_MASK                        equ 0008h
CCP5CAP_CTS4_POSN                        equ 0004h
CCP5CAP_CTS4_POSITION                    equ 0004h
CCP5CAP_CTS4_SIZE                        equ 0001h
CCP5CAP_CTS4_LENGTH                      equ 0001h
CCP5CAP_CTS4_MASK                        equ 0010h
CCP5CAP_CTS5_POSN                        equ 0005h
CCP5CAP_CTS5_POSITION                    equ 0005h
CCP5CAP_CTS5_SIZE                        equ 0001h
CCP5CAP_CTS5_LENGTH                      equ 0001h
CCP5CAP_CTS5_MASK                        equ 0020h
CCP5CAP_CTS6_POSN                        equ 0006h
CCP5CAP_CTS6_POSITION                    equ 0006h
CCP5CAP_CTS6_SIZE                        equ 0001h
CCP5CAP_CTS6_LENGTH                      equ 0001h
CCP5CAP_CTS6_MASK                        equ 0040h
CCP5CAP_CTS7_POSN                        equ 0007h
CCP5CAP_CTS7_POSITION                    equ 0007h
CCP5CAP_CTS7_SIZE                        equ 0001h
CCP5CAP_CTS7_LENGTH                      equ 0001h
CCP5CAP_CTS7_MASK                        equ 0080h
CCP5CAP_CCP5CTS_POSN                     equ 0000h
CCP5CAP_CCP5CTS_POSITION                 equ 0000h
CCP5CAP_CCP5CTS_SIZE                     equ 0008h
CCP5CAP_CCP5CTS_LENGTH                   equ 0008h
CCP5CAP_CCP5CTS_MASK                     equ 00FFh
CCP5CAP_CCP5CTS0_POSN                    equ 0000h
CCP5CAP_CCP5CTS0_POSITION                equ 0000h
CCP5CAP_CCP5CTS0_SIZE                    equ 0001h
CCP5CAP_CCP5CTS0_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS0_MASK                    equ 0001h
CCP5CAP_CCP5CTS1_POSN                    equ 0001h
CCP5CAP_CCP5CTS1_POSITION                equ 0001h
CCP5CAP_CCP5CTS1_SIZE                    equ 0001h
CCP5CAP_CCP5CTS1_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS1_MASK                    equ 0002h
CCP5CAP_CCP5CTS2_POSN                    equ 0002h
CCP5CAP_CCP5CTS2_POSITION                equ 0002h
CCP5CAP_CCP5CTS2_SIZE                    equ 0001h
CCP5CAP_CCP5CTS2_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS2_MASK                    equ 0004h
CCP5CAP_CCP5CTS3_POSN                    equ 0003h
CCP5CAP_CCP5CTS3_POSITION                equ 0003h
CCP5CAP_CCP5CTS3_SIZE                    equ 0001h
CCP5CAP_CCP5CTS3_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS3_MASK                    equ 0008h
CCP5CAP_CCP5CTS4_POSN                    equ 0004h
CCP5CAP_CCP5CTS4_POSITION                equ 0004h
CCP5CAP_CCP5CTS4_SIZE                    equ 0001h
CCP5CAP_CCP5CTS4_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS4_MASK                    equ 0010h
CCP5CAP_CCP5CTS5_POSN                    equ 0005h
CCP5CAP_CCP5CTS5_POSITION                equ 0005h
CCP5CAP_CCP5CTS5_SIZE                    equ 0001h
CCP5CAP_CCP5CTS5_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS5_MASK                    equ 0020h
CCP5CAP_CCP5CTS6_POSN                    equ 0006h
CCP5CAP_CCP5CTS6_POSITION                equ 0006h
CCP5CAP_CCP5CTS6_SIZE                    equ 0001h
CCP5CAP_CCP5CTS6_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS6_MASK                    equ 0040h
CCP5CAP_CCP5CTS7_POSN                    equ 0007h
CCP5CAP_CCP5CTS7_POSITION                equ 0007h
CCP5CAP_CCP5CTS7_SIZE                    equ 0001h
CCP5CAP_CCP5CTS7_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS7_MASK                    equ 0080h

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 038Ch
// bitfield definitions
PWM6DCL_DC_POSN                          equ 0006h
PWM6DCL_DC_POSITION                      equ 0006h
PWM6DCL_DC_SIZE                          equ 0002h
PWM6DCL_DC_LENGTH                        equ 0002h
PWM6DCL_DC_MASK                          equ 00C0h
PWM6DCL_DC0_POSN                         equ 0006h
PWM6DCL_DC0_POSITION                     equ 0006h
PWM6DCL_DC0_SIZE                         equ 0001h
PWM6DCL_DC0_LENGTH                       equ 0001h
PWM6DCL_DC0_MASK                         equ 0040h
PWM6DCL_DC1_POSN                         equ 0007h
PWM6DCL_DC1_POSITION                     equ 0007h
PWM6DCL_DC1_SIZE                         equ 0001h
PWM6DCL_DC1_LENGTH                       equ 0001h
PWM6DCL_DC1_MASK                         equ 0080h
PWM6DCL_PWM6DC0_POSN                     equ 0006h
PWM6DCL_PWM6DC0_POSITION                 equ 0006h
PWM6DCL_PWM6DC0_SIZE                     equ 0001h
PWM6DCL_PWM6DC0_LENGTH                   equ 0001h
PWM6DCL_PWM6DC0_MASK                     equ 0040h
PWM6DCL_PWM6DC1_POSN                     equ 0007h
PWM6DCL_PWM6DC1_POSITION                 equ 0007h
PWM6DCL_PWM6DC1_SIZE                     equ 0001h
PWM6DCL_PWM6DC1_LENGTH                   equ 0001h
PWM6DCL_PWM6DC1_MASK                     equ 0080h
PWM6DCL_PWMPW0_POSN                      equ 0006h
PWM6DCL_PWMPW0_POSITION                  equ 0006h
PWM6DCL_PWMPW0_SIZE                      equ 0001h
PWM6DCL_PWMPW0_LENGTH                    equ 0001h
PWM6DCL_PWMPW0_MASK                      equ 0040h
PWM6DCL_PWMPW1_POSN                      equ 0007h
PWM6DCL_PWMPW1_POSITION                  equ 0007h
PWM6DCL_PWMPW1_SIZE                      equ 0001h
PWM6DCL_PWMPW1_LENGTH                    equ 0001h
PWM6DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 038Dh
// bitfield definitions
PWM6DCH_DC_POSN                          equ 0000h
PWM6DCH_DC_POSITION                      equ 0000h
PWM6DCH_DC_SIZE                          equ 0008h
PWM6DCH_DC_LENGTH                        equ 0008h
PWM6DCH_DC_MASK                          equ 00FFh
PWM6DCH_DC2_POSN                         equ 0000h
PWM6DCH_DC2_POSITION                     equ 0000h
PWM6DCH_DC2_SIZE                         equ 0001h
PWM6DCH_DC2_LENGTH                       equ 0001h
PWM6DCH_DC2_MASK                         equ 0001h
PWM6DCH_DC3_POSN                         equ 0001h
PWM6DCH_DC3_POSITION                     equ 0001h
PWM6DCH_DC3_SIZE                         equ 0001h
PWM6DCH_DC3_LENGTH                       equ 0001h
PWM6DCH_DC3_MASK                         equ 0002h
PWM6DCH_DC4_POSN                         equ 0002h
PWM6DCH_DC4_POSITION                     equ 0002h
PWM6DCH_DC4_SIZE                         equ 0001h
PWM6DCH_DC4_LENGTH                       equ 0001h
PWM6DCH_DC4_MASK                         equ 0004h
PWM6DCH_DC5_POSN                         equ 0003h
PWM6DCH_DC5_POSITION                     equ 0003h
PWM6DCH_DC5_SIZE                         equ 0001h
PWM6DCH_DC5_LENGTH                       equ 0001h
PWM6DCH_DC5_MASK                         equ 0008h
PWM6DCH_DC6_POSN                         equ 0004h
PWM6DCH_DC6_POSITION                     equ 0004h
PWM6DCH_DC6_SIZE                         equ 0001h
PWM6DCH_DC6_LENGTH                       equ 0001h
PWM6DCH_DC6_MASK                         equ 0010h
PWM6DCH_DC7_POSN                         equ 0005h
PWM6DCH_DC7_POSITION                     equ 0005h
PWM6DCH_DC7_SIZE                         equ 0001h
PWM6DCH_DC7_LENGTH                       equ 0001h
PWM6DCH_DC7_MASK                         equ 0020h
PWM6DCH_DC8_POSN                         equ 0006h
PWM6DCH_DC8_POSITION                     equ 0006h
PWM6DCH_DC8_SIZE                         equ 0001h
PWM6DCH_DC8_LENGTH                       equ 0001h
PWM6DCH_DC8_MASK                         equ 0040h
PWM6DCH_DC9_POSN                         equ 0007h
PWM6DCH_DC9_POSITION                     equ 0007h
PWM6DCH_DC9_SIZE                         equ 0001h
PWM6DCH_DC9_LENGTH                       equ 0001h
PWM6DCH_DC9_MASK                         equ 0080h
PWM6DCH_PWM6DC2_POSN                     equ 0000h
PWM6DCH_PWM6DC2_POSITION                 equ 0000h
PWM6DCH_PWM6DC2_SIZE                     equ 0001h
PWM6DCH_PWM6DC2_LENGTH                   equ 0001h
PWM6DCH_PWM6DC2_MASK                     equ 0001h
PWM6DCH_PWM6DC3_POSN                     equ 0001h
PWM6DCH_PWM6DC3_POSITION                 equ 0001h
PWM6DCH_PWM6DC3_SIZE                     equ 0001h
PWM6DCH_PWM6DC3_LENGTH                   equ 0001h
PWM6DCH_PWM6DC3_MASK                     equ 0002h
PWM6DCH_PWM6DC4_POSN                     equ 0002h
PWM6DCH_PWM6DC4_POSITION                 equ 0002h
PWM6DCH_PWM6DC4_SIZE                     equ 0001h
PWM6DCH_PWM6DC4_LENGTH                   equ 0001h
PWM6DCH_PWM6DC4_MASK                     equ 0004h
PWM6DCH_PWM6DC5_POSN                     equ 0003h
PWM6DCH_PWM6DC5_POSITION                 equ 0003h
PWM6DCH_PWM6DC5_SIZE                     equ 0001h
PWM6DCH_PWM6DC5_LENGTH                   equ 0001h
PWM6DCH_PWM6DC5_MASK                     equ 0008h
PWM6DCH_PWM6DC6_POSN                     equ 0004h
PWM6DCH_PWM6DC6_POSITION                 equ 0004h
PWM6DCH_PWM6DC6_SIZE                     equ 0001h
PWM6DCH_PWM6DC6_LENGTH                   equ 0001h
PWM6DCH_PWM6DC6_MASK                     equ 0010h
PWM6DCH_PWM6DC7_POSN                     equ 0005h
PWM6DCH_PWM6DC7_POSITION                 equ 0005h
PWM6DCH_PWM6DC7_SIZE                     equ 0001h
PWM6DCH_PWM6DC7_LENGTH                   equ 0001h
PWM6DCH_PWM6DC7_MASK                     equ 0020h
PWM6DCH_PWM6DC8_POSN                     equ 0006h
PWM6DCH_PWM6DC8_POSITION                 equ 0006h
PWM6DCH_PWM6DC8_SIZE                     equ 0001h
PWM6DCH_PWM6DC8_LENGTH                   equ 0001h
PWM6DCH_PWM6DC8_MASK                     equ 0040h
PWM6DCH_PWM6DC9_POSN                     equ 0007h
PWM6DCH_PWM6DC9_POSITION                 equ 0007h
PWM6DCH_PWM6DC9_SIZE                     equ 0001h
PWM6DCH_PWM6DC9_LENGTH                   equ 0001h
PWM6DCH_PWM6DC9_MASK                     equ 0080h
PWM6DCH_PWMPW2_POSN                      equ 0000h
PWM6DCH_PWMPW2_POSITION                  equ 0000h
PWM6DCH_PWMPW2_SIZE                      equ 0001h
PWM6DCH_PWMPW2_LENGTH                    equ 0001h
PWM6DCH_PWMPW2_MASK                      equ 0001h
PWM6DCH_PWMPW3_POSN                      equ 0001h
PWM6DCH_PWMPW3_POSITION                  equ 0001h
PWM6DCH_PWMPW3_SIZE                      equ 0001h
PWM6DCH_PWMPW3_LENGTH                    equ 0001h
PWM6DCH_PWMPW3_MASK                      equ 0002h
PWM6DCH_PWMPW4_POSN                      equ 0002h
PWM6DCH_PWMPW4_POSITION                  equ 0002h
PWM6DCH_PWMPW4_SIZE                      equ 0001h
PWM6DCH_PWMPW4_LENGTH                    equ 0001h
PWM6DCH_PWMPW4_MASK                      equ 0004h
PWM6DCH_PWMPW5_POSN                      equ 0003h
PWM6DCH_PWMPW5_POSITION                  equ 0003h
PWM6DCH_PWMPW5_SIZE                      equ 0001h
PWM6DCH_PWMPW5_LENGTH                    equ 0001h
PWM6DCH_PWMPW5_MASK                      equ 0008h
PWM6DCH_PWMPW6_POSN                      equ 0004h
PWM6DCH_PWMPW6_POSITION                  equ 0004h
PWM6DCH_PWMPW6_SIZE                      equ 0001h
PWM6DCH_PWMPW6_LENGTH                    equ 0001h
PWM6DCH_PWMPW6_MASK                      equ 0010h
PWM6DCH_PWMPW7_POSN                      equ 0005h
PWM6DCH_PWMPW7_POSITION                  equ 0005h
PWM6DCH_PWMPW7_SIZE                      equ 0001h
PWM6DCH_PWMPW7_LENGTH                    equ 0001h
PWM6DCH_PWMPW7_MASK                      equ 0020h
PWM6DCH_PWMPW8_POSN                      equ 0006h
PWM6DCH_PWMPW8_POSITION                  equ 0006h
PWM6DCH_PWMPW8_SIZE                      equ 0001h
PWM6DCH_PWMPW8_LENGTH                    equ 0001h
PWM6DCH_PWMPW8_MASK                      equ 0040h
PWM6DCH_PWMPW9_POSN                      equ 0007h
PWM6DCH_PWMPW9_POSITION                  equ 0007h
PWM6DCH_PWMPW9_SIZE                      equ 0001h
PWM6DCH_PWMPW9_LENGTH                    equ 0001h
PWM6DCH_PWMPW9_MASK                      equ 0080h

