GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.inc
// Register: CWG2DBF
#define CWG2DBF CWG2DBF
CWG2DBF                                  equ 0619h
// bitfield definitions
CWG2DBF_DBF_POSN                         equ 0000h
CWG2DBF_DBF_POSITION                     equ 0000h
CWG2DBF_DBF_SIZE                         equ 0006h
CWG2DBF_DBF_LENGTH                       equ 0006h
CWG2DBF_DBF_MASK                         equ 003Fh
CWG2DBF_DBF0_POSN                        equ 0000h
CWG2DBF_DBF0_POSITION                    equ 0000h
CWG2DBF_DBF0_SIZE                        equ 0001h
CWG2DBF_DBF0_LENGTH                      equ 0001h
CWG2DBF_DBF0_MASK                        equ 0001h
CWG2DBF_DBF1_POSN                        equ 0001h
CWG2DBF_DBF1_POSITION                    equ 0001h
CWG2DBF_DBF1_SIZE                        equ 0001h
CWG2DBF_DBF1_LENGTH                      equ 0001h
CWG2DBF_DBF1_MASK                        equ 0002h
CWG2DBF_DBF2_POSN                        equ 0002h
CWG2DBF_DBF2_POSITION                    equ 0002h
CWG2DBF_DBF2_SIZE                        equ 0001h
CWG2DBF_DBF2_LENGTH                      equ 0001h
CWG2DBF_DBF2_MASK                        equ 0004h
CWG2DBF_DBF3_POSN                        equ 0003h
CWG2DBF_DBF3_POSITION                    equ 0003h
CWG2DBF_DBF3_SIZE                        equ 0001h
CWG2DBF_DBF3_LENGTH                      equ 0001h
CWG2DBF_DBF3_MASK                        equ 0008h
CWG2DBF_DBF4_POSN                        equ 0004h
CWG2DBF_DBF4_POSITION                    equ 0004h
CWG2DBF_DBF4_SIZE                        equ 0001h
CWG2DBF_DBF4_LENGTH                      equ 0001h
CWG2DBF_DBF4_MASK                        equ 0010h
CWG2DBF_DBF5_POSN                        equ 0005h
CWG2DBF_DBF5_POSITION                    equ 0005h
CWG2DBF_DBF5_SIZE                        equ 0001h
CWG2DBF_DBF5_LENGTH                      equ 0001h
CWG2DBF_DBF5_MASK                        equ 0020h
CWG2DBF_CWG2DBF_POSN                     equ 0000h
CWG2DBF_CWG2DBF_POSITION                 equ 0000h
CWG2DBF_CWG2DBF_SIZE                     equ 0006h
CWG2DBF_CWG2DBF_LENGTH                   equ 0006h
CWG2DBF_CWG2DBF_MASK                     equ 003Fh
CWG2DBF_CWG2DBF0_POSN                    equ 0000h
CWG2DBF_CWG2DBF0_POSITION                equ 0000h
CWG2DBF_CWG2DBF0_SIZE                    equ 0001h
CWG2DBF_CWG2DBF0_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF0_MASK                    equ 0001h
CWG2DBF_CWG2DBF1_POSN                    equ 0001h
CWG2DBF_CWG2DBF1_POSITION                equ 0001h
CWG2DBF_CWG2DBF1_SIZE                    equ 0001h
CWG2DBF_CWG2DBF1_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF1_MASK                    equ 0002h
CWG2DBF_CWG2DBF2_POSN                    equ 0002h
CWG2DBF_CWG2DBF2_POSITION                equ 0002h
CWG2DBF_CWG2DBF2_SIZE                    equ 0001h
CWG2DBF_CWG2DBF2_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF2_MASK                    equ 0004h
CWG2DBF_CWG2DBF3_POSN                    equ 0003h
CWG2DBF_CWG2DBF3_POSITION                equ 0003h
CWG2DBF_CWG2DBF3_SIZE                    equ 0001h
CWG2DBF_CWG2DBF3_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF3_MASK                    equ 0008h
CWG2DBF_CWG2DBF4_POSN                    equ 0004h
CWG2DBF_CWG2DBF4_POSITION                equ 0004h
CWG2DBF_CWG2DBF4_SIZE                    equ 0001h
CWG2DBF_CWG2DBF4_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF4_MASK                    equ 0010h
CWG2DBF_CWG2DBF5_POSN                    equ 0005h
CWG2DBF_CWG2DBF5_POSITION                equ 0005h
CWG2DBF_CWG2DBF5_SIZE                    equ 0001h
CWG2DBF_CWG2DBF5_LENGTH                  equ 0001h
CWG2DBF_CWG2DBF5_MASK                    equ 0020h

// Register: CWG2CON0
#define CWG2CON0 CWG2CON0
CWG2CON0                                 equ 061Ah
// bitfield definitions
CWG2CON0_MODE_POSN                       equ 0000h
CWG2CON0_MODE_POSITION                   equ 0000h
CWG2CON0_MODE_SIZE                       equ 0003h
CWG2CON0_MODE_LENGTH                     equ 0003h
CWG2CON0_MODE_MASK                       equ 0007h
CWG2CON0_LD_POSN                         equ 0006h
CWG2CON0_LD_POSITION                     equ 0006h
CWG2CON0_LD_SIZE                         equ 0001h
CWG2CON0_LD_LENGTH                       equ 0001h
CWG2CON0_LD_MASK                         equ 0040h
CWG2CON0_EN_POSN                         equ 0007h
CWG2CON0_EN_POSITION                     equ 0007h
CWG2CON0_EN_SIZE                         equ 0001h
CWG2CON0_EN_LENGTH                       equ 0001h
CWG2CON0_EN_MASK                         equ 0080h
CWG2CON0_MODE0_POSN                      equ 0000h
CWG2CON0_MODE0_POSITION                  equ 0000h
CWG2CON0_MODE0_SIZE                      equ 0001h
CWG2CON0_MODE0_LENGTH                    equ 0001h
CWG2CON0_MODE0_MASK                      equ 0001h
CWG2CON0_MODE1_POSN                      equ 0001h
CWG2CON0_MODE1_POSITION                  equ 0001h
CWG2CON0_MODE1_SIZE                      equ 0001h
CWG2CON0_MODE1_LENGTH                    equ 0001h
CWG2CON0_MODE1_MASK                      equ 0002h
CWG2CON0_MODE2_POSN                      equ 0002h
CWG2CON0_MODE2_POSITION                  equ 0002h
CWG2CON0_MODE2_SIZE                      equ 0001h
CWG2CON0_MODE2_LENGTH                    equ 0001h
CWG2CON0_MODE2_MASK                      equ 0004h
CWG2CON0_G2EN_POSN                       equ 0007h
CWG2CON0_G2EN_POSITION                   equ 0007h
CWG2CON0_G2EN_SIZE                       equ 0001h
CWG2CON0_G2EN_LENGTH                     equ 0001h
CWG2CON0_G2EN_MASK                       equ 0080h
CWG2CON0_CWG2MODE_POSN                   equ 0000h
CWG2CON0_CWG2MODE_POSITION               equ 0000h
CWG2CON0_CWG2MODE_SIZE                   equ 0003h
CWG2CON0_CWG2MODE_LENGTH                 equ 0003h
CWG2CON0_CWG2MODE_MASK                   equ 0007h
CWG2CON0_CWG2LD_POSN                     equ 0006h
CWG2CON0_CWG2LD_POSITION                 equ 0006h
CWG2CON0_CWG2LD_SIZE                     equ 0001h
CWG2CON0_CWG2LD_LENGTH                   equ 0001h
CWG2CON0_CWG2LD_MASK                     equ 0040h
CWG2CON0_CWG2EN_POSN                     equ 0007h
CWG2CON0_CWG2EN_POSITION                 equ 0007h
CWG2CON0_CWG2EN_SIZE                     equ 0001h
CWG2CON0_CWG2EN_LENGTH                   equ 0001h
CWG2CON0_CWG2EN_MASK                     equ 0080h
CWG2CON0_CWG2MODE0_POSN                  equ 0000h
CWG2CON0_CWG2MODE0_POSITION              equ 0000h
CWG2CON0_CWG2MODE0_SIZE                  equ 0001h
CWG2CON0_CWG2MODE0_LENGTH                equ 0001h
CWG2CON0_CWG2MODE0_MASK                  equ 0001h
CWG2CON0_CWG2MODE1_POSN                  equ 0001h
CWG2CON0_CWG2MODE1_POSITION              equ 0001h
CWG2CON0_CWG2MODE1_SIZE                  equ 0001h
CWG2CON0_CWG2MODE1_LENGTH                equ 0001h
CWG2CON0_CWG2MODE1_MASK                  equ 0002h
CWG2CON0_CWG2MODE2_POSN                  equ 0002h
CWG2CON0_CWG2MODE2_POSITION              equ 0002h
CWG2CON0_CWG2MODE2_SIZE                  equ 0001h
CWG2CON0_CWG2MODE2_LENGTH                equ 0001h
CWG2CON0_CWG2MODE2_MASK                  equ 0004h

// Register: CWG2CON1
#define CWG2CON1 CWG2CON1
CWG2CON1                                 equ 061Bh
// bitfield definitions
CWG2CON1_POLA_POSN                       equ 0000h
CWG2CON1_POLA_POSITION                   equ 0000h
CWG2CON1_POLA_SIZE                       equ 0001h
CWG2CON1_POLA_LENGTH                     equ 0001h
CWG2CON1_POLA_MASK                       equ 0001h
CWG2CON1_POLB_POSN                       equ 0001h
CWG2CON1_POLB_POSITION                   equ 0001h
CWG2CON1_POLB_SIZE                       equ 0001h
CWG2CON1_POLB_LENGTH                     equ 0001h
CWG2CON1_POLB_MASK                       equ 0002h
CWG2CON1_POLC_POSN                       equ 0002h
CWG2CON1_POLC_POSITION                   equ 0002h
CWG2CON1_POLC_SIZE                       equ 0001h
CWG2CON1_POLC_LENGTH                     equ 0001h
CWG2CON1_POLC_MASK                       equ 0004h
CWG2CON1_POLD_POSN                       equ 0003h
CWG2CON1_POLD_POSITION                   equ 0003h
CWG2CON1_POLD_SIZE                       equ 0001h
CWG2CON1_POLD_LENGTH                     equ 0001h
CWG2CON1_POLD_MASK                       equ 0008h
CWG2CON1_IN_POSN                         equ 0005h
CWG2CON1_IN_POSITION                     equ 0005h
CWG2CON1_IN_SIZE                         equ 0001h
CWG2CON1_IN_LENGTH                       equ 0001h
CWG2CON1_IN_MASK                         equ 0020h
CWG2CON1_CWG2POLA_POSN                   equ 0000h
CWG2CON1_CWG2POLA_POSITION               equ 0000h
CWG2CON1_CWG2POLA_SIZE                   equ 0001h
CWG2CON1_CWG2POLA_LENGTH                 equ 0001h
CWG2CON1_CWG2POLA_MASK                   equ 0001h
CWG2CON1_CWG2POLB_POSN                   equ 0001h
CWG2CON1_CWG2POLB_POSITION               equ 0001h
CWG2CON1_CWG2POLB_SIZE                   equ 0001h
CWG2CON1_CWG2POLB_LENGTH                 equ 0001h
CWG2CON1_CWG2POLB_MASK                   equ 0002h
CWG2CON1_CWG2POLC_POSN                   equ 0002h
CWG2CON1_CWG2POLC_POSITION               equ 0002h
CWG2CON1_CWG2POLC_SIZE                   equ 0001h
CWG2CON1_CWG2POLC_LENGTH                 equ 0001h
CWG2CON1_CWG2POLC_MASK                   equ 0004h
CWG2CON1_CWG2POLD_POSN                   equ 0003h
CWG2CON1_CWG2POLD_POSITION               equ 0003h
CWG2CON1_CWG2POLD_SIZE                   equ 0001h
CWG2CON1_CWG2POLD_LENGTH                 equ 0001h
CWG2CON1_CWG2POLD_MASK                   equ 0008h
CWG2CON1_CWG2IN_POSN                     equ 0005h
CWG2CON1_CWG2IN_POSITION                 equ 0005h
CWG2CON1_CWG2IN_SIZE                     equ 0001h
CWG2CON1_CWG2IN_LENGTH                   equ 0001h
CWG2CON1_CWG2IN_MASK                     equ 0020h

// Register: CWG2AS0
#define CWG2AS0 CWG2AS0
CWG2AS0                                  equ 061Ch
// bitfield definitions
CWG2AS0_LSAC_POSN                        equ 0002h
CWG2AS0_LSAC_POSITION                    equ 0002h
CWG2AS0_LSAC_SIZE                        equ 0002h
CWG2AS0_LSAC_LENGTH                      equ 0002h
CWG2AS0_LSAC_MASK                        equ 000Ch
CWG2AS0_LSBD_POSN                        equ 0004h
CWG2AS0_LSBD_POSITION                    equ 0004h
CWG2AS0_LSBD_SIZE                        equ 0002h
CWG2AS0_LSBD_LENGTH                      equ 0002h
CWG2AS0_LSBD_MASK                        equ 0030h
CWG2AS0_REN_POSN                         equ 0006h
CWG2AS0_REN_POSITION                     equ 0006h
CWG2AS0_REN_SIZE                         equ 0001h
CWG2AS0_REN_LENGTH                       equ 0001h
CWG2AS0_REN_MASK                         equ 0040h
CWG2AS0_SHUTDOWN_POSN                    equ 0007h
CWG2AS0_SHUTDOWN_POSITION                equ 0007h
CWG2AS0_SHUTDOWN_SIZE                    equ 0001h
CWG2AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG2AS0_SHUTDOWN_MASK                    equ 0080h
CWG2AS0_LSAC0_POSN                       equ 0002h
CWG2AS0_LSAC0_POSITION                   equ 0002h
CWG2AS0_LSAC0_SIZE                       equ 0001h
CWG2AS0_LSAC0_LENGTH                     equ 0001h
CWG2AS0_LSAC0_MASK                       equ 0004h
CWG2AS0_LSCA1_POSN                       equ 0003h
CWG2AS0_LSCA1_POSITION                   equ 0003h
CWG2AS0_LSCA1_SIZE                       equ 0001h
CWG2AS0_LSCA1_LENGTH                     equ 0001h
CWG2AS0_LSCA1_MASK                       equ 0008h
CWG2AS0_LSBD0_POSN                       equ 0004h
CWG2AS0_LSBD0_POSITION                   equ 0004h
CWG2AS0_LSBD0_SIZE                       equ 0001h
CWG2AS0_LSBD0_LENGTH                     equ 0001h
CWG2AS0_LSBD0_MASK                       equ 0010h
CWG2AS0_LSBD1_POSN                       equ 0005h
CWG2AS0_LSBD1_POSITION                   equ 0005h
CWG2AS0_LSBD1_SIZE                       equ 0001h
CWG2AS0_LSBD1_LENGTH                     equ 0001h
CWG2AS0_LSBD1_MASK                       equ 0020h
CWG2AS0_CWG2LSAC_POSN                    equ 0002h
CWG2AS0_CWG2LSAC_POSITION                equ 0002h
CWG2AS0_CWG2LSAC_SIZE                    equ 0002h
CWG2AS0_CWG2LSAC_LENGTH                  equ 0002h
CWG2AS0_CWG2LSAC_MASK                    equ 000Ch
CWG2AS0_CWG2LSBD_POSN                    equ 0004h
CWG2AS0_CWG2LSBD_POSITION                equ 0004h
CWG2AS0_CWG2LSBD_SIZE                    equ 0002h
CWG2AS0_CWG2LSBD_LENGTH                  equ 0002h
CWG2AS0_CWG2LSBD_MASK                    equ 0030h
CWG2AS0_CWG2REN_POSN                     equ 0006h
CWG2AS0_CWG2REN_POSITION                 equ 0006h
CWG2AS0_CWG2REN_SIZE                     equ 0001h
CWG2AS0_CWG2REN_LENGTH                   equ 0001h
CWG2AS0_CWG2REN_MASK                     equ 0040h
CWG2AS0_CWG2SHUTDOWN_POSN                equ 0007h
CWG2AS0_CWG2SHUTDOWN_POSITION            equ 0007h
CWG2AS0_CWG2SHUTDOWN_SIZE                equ 0001h
CWG2AS0_CWG2SHUTDOWN_LENGTH              equ 0001h
CWG2AS0_CWG2SHUTDOWN_MASK                equ 0080h
CWG2AS0_CWG2LSAC0_POSN                   equ 0002h
CWG2AS0_CWG2LSAC0_POSITION               equ 0002h
CWG2AS0_CWG2LSAC0_SIZE                   equ 0001h
CWG2AS0_CWG2LSAC0_LENGTH                 equ 0001h
CWG2AS0_CWG2LSAC0_MASK                   equ 0004h
CWG2AS0_CWG2LSAC1_POSN                   equ 0003h
CWG2AS0_CWG2LSAC1_POSITION               equ 0003h
CWG2AS0_CWG2LSAC1_SIZE                   equ 0001h
CWG2AS0_CWG2LSAC1_LENGTH                 equ 0001h
CWG2AS0_CWG2LSAC1_MASK                   equ 0008h
CWG2AS0_CWG2LSBD0_POSN                   equ 0004h
CWG2AS0_CWG2LSBD0_POSITION               equ 0004h
CWG2AS0_CWG2LSBD0_SIZE                   equ 0001h
CWG2AS0_CWG2LSBD0_LENGTH                 equ 0001h
CWG2AS0_CWG2LSBD0_MASK                   equ 0010h
CWG2AS0_CWG2LSBD1_POSN                   equ 0005h
CWG2AS0_CWG2LSBD1_POSITION               equ 0005h
CWG2AS0_CWG2LSBD1_SIZE                   equ 0001h
CWG2AS0_CWG2LSBD1_LENGTH                 equ 0001h
CWG2AS0_CWG2LSBD1_MASK                   equ 0020h

