GopalSaraf/Practicals/PSDL/include/proc/pic16lf18455.inc
// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 01E94h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0005h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0005h
T3CKIPPS_T3CKIPPS_MASK                   equ 001Fh
T3CKIPPS_T3CKIPPS0_POSN                  equ 0000h
T3CKIPPS_T3CKIPPS0_POSITION              equ 0000h
T3CKIPPS_T3CKIPPS0_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS0_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS0_MASK                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSN                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSITION              equ 0001h
T3CKIPPS_T3CKIPPS1_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS1_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS1_MASK                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSN                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSITION              equ 0002h
T3CKIPPS_T3CKIPPS2_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS2_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS2_MASK                  equ 0004h
T3CKIPPS_T3CKIPPS3_POSN                  equ 0003h
T3CKIPPS_T3CKIPPS3_POSITION              equ 0003h
T3CKIPPS_T3CKIPPS3_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS3_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS3_MASK                  equ 0008h
T3CKIPPS_T3CKIPPS4_POSN                  equ 0004h
T3CKIPPS_T3CKIPPS4_POSITION              equ 0004h
T3CKIPPS_T3CKIPPS4_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS4_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS4_MASK                  equ 0010h

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 01E95h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0005h
T3GPPS_T3GPPS_LENGTH                     equ 0005h
T3GPPS_T3GPPS_MASK                       equ 001Fh
T3GPPS_T3GPPS0_POSN                      equ 0000h
T3GPPS_T3GPPS0_POSITION                  equ 0000h
T3GPPS_T3GPPS0_SIZE                      equ 0001h
T3GPPS_T3GPPS0_LENGTH                    equ 0001h
T3GPPS_T3GPPS0_MASK                      equ 0001h
T3GPPS_T3GPPS1_POSN                      equ 0001h
T3GPPS_T3GPPS1_POSITION                  equ 0001h
T3GPPS_T3GPPS1_SIZE                      equ 0001h
T3GPPS_T3GPPS1_LENGTH                    equ 0001h
T3GPPS_T3GPPS1_MASK                      equ 0002h
T3GPPS_T3GPPS2_POSN                      equ 0002h
T3GPPS_T3GPPS2_POSITION                  equ 0002h
T3GPPS_T3GPPS2_SIZE                      equ 0001h
T3GPPS_T3GPPS2_LENGTH                    equ 0001h
T3GPPS_T3GPPS2_MASK                      equ 0004h
T3GPPS_T3GPPS3_POSN                      equ 0003h
T3GPPS_T3GPPS3_POSITION                  equ 0003h
T3GPPS_T3GPPS3_SIZE                      equ 0001h
T3GPPS_T3GPPS3_LENGTH                    equ 0001h
T3GPPS_T3GPPS3_MASK                      equ 0008h
T3GPPS_T3GPPS4_POSN                      equ 0004h
T3GPPS_T3GPPS4_POSITION                  equ 0004h
T3GPPS_T3GPPS4_SIZE                      equ 0001h
T3GPPS_T3GPPS4_LENGTH                    equ 0001h
T3GPPS_T3GPPS4_MASK                      equ 0010h

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 01E96h
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0005h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0005h
T5CKIPPS_T5CKIPPS_MASK                   equ 001Fh
T5CKIPPS_T5CKIPPS0_POSN                  equ 0000h
T5CKIPPS_T5CKIPPS0_POSITION              equ 0000h
T5CKIPPS_T5CKIPPS0_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS0_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS0_MASK                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSN                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSITION              equ 0001h
T5CKIPPS_T5CKIPPS1_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS1_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS1_MASK                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSN                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSITION              equ 0002h
T5CKIPPS_T5CKIPPS2_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS2_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS2_MASK                  equ 0004h
T5CKIPPS_T5CKIPP3_POSN                   equ 0003h
T5CKIPPS_T5CKIPP3_POSITION               equ 0003h
T5CKIPPS_T5CKIPP3_SIZE                   equ 0001h
T5CKIPPS_T5CKIPP3_LENGTH                 equ 0001h
T5CKIPPS_T5CKIPP3_MASK                   equ 0008h
T5CKIPPS_T5CKIPPS4_POSN                  equ 0004h
T5CKIPPS_T5CKIPPS4_POSITION              equ 0004h
T5CKIPPS_T5CKIPPS4_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS4_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS4_MASK                  equ 0010h

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 01E97h
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0005h
T5GPPS_T5GPPS_LENGTH                     equ 0005h
T5GPPS_T5GPPS_MASK                       equ 001Fh
T5GPPS_T5GPPS0_POSN                      equ 0000h
T5GPPS_T5GPPS0_POSITION                  equ 0000h
T5GPPS_T5GPPS0_SIZE                      equ 0001h
T5GPPS_T5GPPS0_LENGTH                    equ 0001h
T5GPPS_T5GPPS0_MASK                      equ 0001h
T5GPPS_T5GPPS1_POSN                      equ 0001h
T5GPPS_T5GPPS1_POSITION                  equ 0001h
T5GPPS_T5GPPS1_SIZE                      equ 0001h
T5GPPS_T5GPPS1_LENGTH                    equ 0001h
T5GPPS_T5GPPS1_MASK                      equ 0002h
T5GPPS_T5GPPS2_POSN                      equ 0002h
T5GPPS_T5GPPS2_POSITION                  equ 0002h
T5GPPS_T5GPPS2_SIZE                      equ 0001h
T5GPPS_T5GPPS2_LENGTH                    equ 0001h
T5GPPS_T5GPPS2_MASK                      equ 0004h
T5GPPS_T5GPPS3_POSN                      equ 0003h
T5GPPS_T5GPPS3_POSITION                  equ 0003h
T5GPPS_T5GPPS3_SIZE                      equ 0001h
T5GPPS_T5GPPS3_LENGTH                    equ 0001h
T5GPPS_T5GPPS3_MASK                      equ 0008h
T5GPPS_T5GPPS4_POSN                      equ 0004h
T5GPPS_T5GPPS4_POSITION                  equ 0004h
T5GPPS_T5GPPS4_SIZE                      equ 0001h
T5GPPS_T5GPPS4_LENGTH                    equ 0001h
T5GPPS_T5GPPS4_MASK                      equ 0010h

